app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @photos = []
    @blog = Blog.find_by(id: params[:id])

INSERT INTO "blogs" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Sissy Vids"], ["url", "sistervids.tumblr.com"], ["created_at", "2015-10-02 07:26:12.348947"], ["updated_at", "2015-10-02 07:26:12.348947"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save